#Generated by Fabric Compiler ( version 2021.4-SP1.2 <build 96435> ) at Fri Oct 13 17:31:26 2023

add_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/mul_2_8/mul_2_8.idf
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/ram_fifo_ctrl.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ram_fifo_ctrl
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ram_fifo_ctrl
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ram_fifo_ctrl
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ram_fifo_ctrl
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ram_fifo_ctrl
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ram_fifo_ctrl
add_simulation "D:/.PDS2021/prj/fifo_ram_ctrl/sim/tb_ram_fifo_ctrl.v"
add_simulation "D:/.PDS2021/prj/fifo_ram_ctrl/sim/tb_ram_fifo_ctrl.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module ram_fifo_ctrl
add_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/ram_fifo/ram_fifo.idf
remove_design -force D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/ram_fifo/ram_fifo.idf
add_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/ram_fifo/ram_fifo.idf
remove_design -force D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/ram_fifo/ram_fifo.idf
add_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/ram_fifo/ram_fifo.idf
remove_design -force D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/ram_fifo/ram_fifo.idf
add_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/ram_fifo/ram_fifo.idf
remove_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/ram_fifo/ram_fifo.idf
add_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/ram_fifo/ram_fifo.idf
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rfifo.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG484
compile -top_module ram_fifo_ctrl
remove_design -verilog "D:/.PDS2021/prj/fifo_ram_ctrl/source/rfifo.v"
synthesize -ads -selected_syn_tool_opt 2 
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rfifo.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG484
compile -top_module ram_fifo_ctrl
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG484
compile -top_module ram_fifo_ctrl
add_simulation "D:/.PDS2021/prj/fifo_ram_ctrl/sim/tb_rfifo.v"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG484
compile -top_module ram_fifo_ctrl
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG484
compile -top_module ram_fifo_ctrl
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG484
compile -top_module ram_fifo_ctrl
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG484
compile -top_module ram_fifo_ctrl
add_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/test_ram/test_ram.idf
remove_design -force D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/test_ram/test_ram.idf
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/ddr_arbit.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/calculator.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/frame_buf.v"
remove_design -verilog "D:/.PDS2021/prj/fifo_ram_ctrl/source/calculator.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/wr_buf.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/wr_fram_buf/wr_fram_buf.idf"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rd_fram_buf/rd_fram_buf.idf"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/cmos_8_16bit.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/fram_buf.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/hdmi_ddr_ov5640_top.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/i2c_com.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/iic_dri.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/ms72xx_ctl.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/ms7200_ctl.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/ms7210_ctl.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/power_on_delay.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/rd_buf.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/rd_ctrl.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/reg_config.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/sync_vg.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/wr_cmd_trans.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/wr_ctrl.v"
add_design "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/wr_rd_ctrl_top.v"
remove_design -verilog "D:/.PDS2021/prj/fifo_ram_ctrl/source/ram_fifo_ctrl.v"
remove_design -verilog "D:/.PDS2021/prj/fifo_ram_ctrl/source/rfifo.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/hdmi_ddr_ov5640_top.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/fram_buf.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/ms72xx_ctl.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/power_on_delay.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/reg_config.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/rd_buf.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/sync_vg.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/cmos_8_16bit.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/i2c_com.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/iic_dri.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/ms7200_ctl.v"
remove_design -verilog "D:/.PDS2021/prj/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/ms7210_ctl.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/cmos_8_16bit.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/fram_buf.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/hdmi_ddr_ov5640_top.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/i2c_com.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/iic_dri.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/ms72xx_ctl.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/ms7200_ctl.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/ms7210_ctl.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/power_on_delay.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/rd_buf.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/reg_config.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/sync_vg.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/wr_buf.v"
remove_design -verilog "D:/.PDS2021/prj/fifo_ram_ctrl/source/wr_buf.v"
add_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/pll/pll.idf
remove_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/pll/pll.idf
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/pll/pll.idf"
add_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/DDR3_50H/DDR3_50H.idf
remove_design -force D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/DDR3_50H/DDR3_50H.idf
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/DDR3_50H/DDR3_50H.idf"
remove_design -force -verilog "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/fram_buf.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/source/wr_buf.v"
remove_design -force -verilog "D:/.PDS2021/prj/fifo_ram_ctrl/source/source/wr_buf.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/source/wr_buf.v"
remove_design -force -verilog "D:/.PDS2021/prj/fifo_ram_ctrl/source/source/wr_buf.v"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/wr_buf.v"
remove_design -force -verilog "D:/.PDS2021/prj/fifo_ram_ctrl/source/rtl/wr_buf.v"
add_constraint "D:/.PDS2021/prj/fifo_ram_ctrl/source/ov5640_50H/hdmi_ddr_ov5640_top.fdc"
set_arch -family Logos -device PGL50G -speedgrade -6 -package MBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
remove_constraint -force -logic -fdc "D:/.PDS2021/prj/fifo_ram_ctrl/source/ov5640_50H/hdmi_ddr_ov5640_top.fdc"
add_constraint "D:/.PDS2021/prj/ov5640_50H/hdmi_ddr_ov5640_top.fdc"
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/ipcore/pll/pll.idf"
remove_design -force D:/.PDS2021/prj/fifo_ram_ctrl/source/ipcore/pll/pll.idf
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/ipcore/pll/pll.idf"
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/source/image_size_down.v"
add_design D:/.PDS2021/prj/fifo_ram_ctrl/ipcore/size_down_fifo/size_down_fifo.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "D:/.PDS2021/prj/fifo_ram_ctrl/source/tb_imgae_size_down.v"
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
remove_simulation "D:/.PDS2021/prj/fifo_ram_ctrl/source/tb_imgae_size_down.v"
add_simulation "D:/.PDS2021/prj/fifo_ram_ctrl/sim/tb_imgae_size_down.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module image_size_down
add_design "D:/.PDS2021/prj/fifo_ram_ctrl/source/image_size_down.v"
remove_design -verilog "D:/.PDS2021/prj/fifo_ram_ctrl/source/source/image_size_down.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "D:/.PDS2021/prj/fifo_ram_ctrl/synthesize/hdmi_ddr_ov5640_top_syn.fic"
dev_map 
dev_map 
dev_map 
dev_map 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic "D:/.PDS2021/prj/fifo_ram_ctrl/synthesize/hdmi_ddr_ov5640_top_syn.fic"
add_fic "D:/.PDS2021/prj/fifo_ram_ctrl/synthesize/hdmi_ddr_ov5640_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
report_timing 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
pnr 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
add_constraint "D:/WeChat Files/wxid_uhuqdjrnqj1j22/FileStorage/File/2023-10/hdmi_ddr_ov5640_top.fdc"
remove_constraint  -logic -fdc "C:/Users/Lenovo/Desktop/1027/ov5640_50H/hdmi_ddr_ov5640_top.fdc"
remove_constraint  -logic -fdc "D:/WeChat Files/wxid_uhuqdjrnqj1j22/FileStorage/File/2023-10/hdmi_ddr_ov5640_top.fdc"
add_constraint "C:/Users/Lenovo/Desktop/1027/fifo_ram_ctrl/source/hdmi_ddr_ov5640_top.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
report_power 
gen_netlist 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/23600/Desktop/full_screen/source/rtl/rd_ctrl.v"
add_design "C:/Users/23600/Desktop/full_screen/source/rtl/wr_cmd_trans.v"
add_design "C:/Users/23600/Desktop/full_screen/source/rtl/wr_ctrl.v"
add_design "C:/Users/23600/Desktop/full_screen/source/rtl/wr_rd_ctrl_top.v"
remove_design -verilog "C:/Users/23600/Desktop/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/rd_ctrl.v"
remove_design -verilog "C:/Users/23600/Desktop/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/wr_cmd_trans.v"
remove_design -verilog "C:/Users/23600/Desktop/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/wr_ctrl.v"
remove_design -verilog "C:/Users/23600/Desktop/6_image_app/hdmi_ddr_ov5640_splice/source/rtl/wr_rd_ctrl_top.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/23600/Desktop/full_screen/source/scale/scaler_2.v"
add_design "C:/Users/23600/Desktop/full_screen/source/image_size_down_without_fifo.v"
add_design "C:/Users/23600/Desktop/full_screen/source/scale/calculator.v"
add_design "C:/Users/23600/Desktop/full_screen/source/scale/ram_fifo_ctrl.v"
add_design "C:/Users/23600/Desktop/full_screen/source/scale/rfifo.v"
add_design "C:/Users/23600/Desktop/full_screen/source/scale/scaler.v"
add_design "C:/Users/23600/Desktop/full_screen/source/scale_fifo/scale_fifo.idf"
add_design "C:/Users/23600/Desktop/full_screen/source/scale/calculator_2.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
remove_design -force C:/Users/23600/Desktop/full_screen/ipcore/ram_fifo/ram_fifo.idf
add_design "C:/Users/23600/Desktop/full_screen/source/ram_fifo/ram_fifo.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
remove_design C:/Users/23600/Desktop/full_screen/source/pll/pll.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
add_design "C:/Users/23600/Desktop/full_screen/source/scale/calculator_3.v"
add_design "C:/Users/23600/Desktop/full_screen/source/scale/scaler_3.v"
remove_design -verilog "C:/Users/23600/Desktop/full_screen/source/scale/scaler_2.v"
remove_design -verilog "C:/Users/23600/Desktop/full_screen/source/scale/calculator_2.v"
add_design "C:/Users/23600/Desktop/full_screen/source/scale/calculator_2.v"
add_design "C:/Users/23600/Desktop/full_screen/source/scale/scaler_2.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/23600/Desktop/full_screen/source/scale/calculator_4.v"
add_design "C:/Users/23600/Desktop/full_screen/source/scale/scaler_4.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "C:/Users/23600/Desktop/full_screen/source/image_size_down.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/23600/Desktop/full_screen/source/key_config.v"
add_design C:/Users/23600/Desktop/full_screen/ipcore/x_scale_rom/x_scale_rom.idf
remove_design -force C:/Users/23600/Desktop/full_screen/ipcore/x_scale_rom/x_scale_rom.idf
add_design C:/Users/23600/Desktop/full_screen/ipcore/x_scale_rom/x_scale_rom.idf
add_design C:/Users/23600/Desktop/full_screen/ipcore/y_scale_rom/y_scale_rom.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "C:/Users/23600/Desktop/full_screen/source/tb_key_config.v"
remove_design -verilog "C:/Users/23600/Desktop/full_screen/source/rtl/hdmi_ddr_ov5640_top.v"
remove_design C:/Users/23600/Desktop/full_screen/source/DDR3_50H/DDR3_50H.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module key_config
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module key_config
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module key_config
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module key_config
synthesize -ads -selected_syn_tool_opt 2 
add_design "C:/Users/23600/Desktop/full_screen/source/rtl/hdmi_ddr_ov5640_top.v"
add_design "C:/Users/23600/Desktop/full_screen/source/DDR3_50H/DDR3_50H.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module key_config
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/23600/Desktop/full_screen/source/hsv_rgb.v"
add_design "C:/Users/23600/Desktop/full_screen/source/rgb_hsv.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/sd/data_gen.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/sd/led_alarm.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/sd/ram_ethhdmi.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/sd/sd_ctrl_top.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/sd/sd_init.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/sd/sd_read.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/sd/sd_write.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/sd/top_sd_rw.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/arp_cache.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/arp_mac_top.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/arp_rx.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/arp_tx.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/check_sum.vh"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/crc32_gen.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/eth_udp_test.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/ethernet_test.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/icmp.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/ip_layer.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/ip_rx.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/ip_tx.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/ip_tx_mode.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/mac_layer.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/mac_rx.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/mac_tx.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/mac_tx_mode.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/rgmii_interface.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/udp_ip_mac_top.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/udp_layer.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/udp_rx.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/eth/udp_tx.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/eth_ram_hdmi/eth_ram_hdmi.idf"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/eth_sd_fifo/eth_sd_fifo.idf"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/icmp_rx_ram_8_256/icmp_rx_ram_8_256.idf"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/pll_sd/pll_sd.idf"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/ref_clock/ref_clock.idf"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/sync_fifo_2048x8b/sync_fifo_2048x8b.idf"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/udp_shift_register/udp_shift_register.idf"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
remove_fic "C:/Users/user/Desktop/full_screen11/full_screen/synthesize/hdmi_ddr_ov5640_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
remove_design -verilog "C:/Users/user/Desktop/full_screen11/full_screen/source/key_config.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/source/key_config.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
remove_design -verilog "C:/Users/user/Desktop/full_screen11/full_screen/source/source/key_config.v"
add_design "C:/Users/user/Desktop/full_screen11/full_screen/source/full_screen/source/key_config.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
add_design "C:/Users/23600/Desktop/1_end/full_screen/source/key_config.v"
remove_design -verilog "C:/Users/23600/Desktop/1_end/full_screen/source/full_screen/source/key_config.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -system_verilog -top_module hdmi_ddr_ov5640_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
